package main

import "fmt"

//5
//位运算符
/*
&	参与运算的两数各对应的二进位相与。（两位均为1才为1）
|	参与运算的两数各对应的二进位相或。（两位有一个为1就为1）
^	参与运算的两数各对应的二进位相异或，当两对应的二进位相异时，结果为1。（两位不一样则为1）
<<	左移n位就是乘以2的n次方。“a<<b”是把a的各二进位全部左移b位，高位丢弃，低位补0。
>>	右移n位就是除以2的n次方。“a>>b”是把a的各二进位全部右移b位。
 */
func main()  {
	//练习1:有两个变量，a和b，要求将其进行交换，最终打印结果。
	var a = 34
	var b = 10
	c := a //c = 34
	a = b //a = 10
	b = c //b = 34
	fmt.Printf("a=%v b=%v\n", a, b)

	//练习2：有两个变量，a和b，要求将其进行交换（不能使用中间变量），最终打印结果.
	var d = 34
	var e = 10

	d = d + e //d = 34+10
	e = d - e//e = (34+10)-10 34
	d = d - e //d= (34+10)-(34+10-10) 44-34=10
	fmt.Printf("d=%v e=%v\n", d, e)

	//练习3：假如还有100天放假，问：xx个星期零xx天
	var days = 100
	var week = days / 7
	var day = days % 7
	fmt.Printf("距离放假还有%v周零%v天", week, day)

	//练习4：定义一个变量保存华氏温度，华氏温度转换摄氏度的公式为：C=(F-32)/1.8，请求出华氏温度对应的摄氏温度
	
	var F float64 = 100 //华氏温度
	C := (F - 32) / 1.8
	fmt.Printf("华氏温度对应的摄氏温度是%.2f",C)

	var k = 5 //101
	var v = 2 //010
	fmt.Println("k&v=", k&v) //000 值0

	fmt.Println("k|v=", k|v) //111 值7

	fmt.Println("k^v=", k^v) ///111 值7

	fmt.Println("k<<v", k<<v) //10100 值20  5*2的2次方

	fmt.Println("k>>v", k>>v) //值1 5/2的2次方

}
